Repository: 84000/data-translation-memory
Catalog: toh467-v3.tmx
Source language: bo
Languages: en

source: ཧཱུྃ་ཧཱུྃ། ཕཱོཾ་ཕོཾ་ཕཊ་ཕཊ་སྭཱ་ཧཱ། བཌྜི་མཱུ་ཏྲ་ཆུ་བསྲེས་པས། དཀྱིལ་འཁོར་གྲུ་གསུམ་བྱས་ནས་ནི། །ལྷ་རྣམས་ཀྱང་ནི་ཚིམ་པར་བྱ། །ཧ་ཧ་ཞེས་ཀྱང་དྲན་པར་བྱ། །
en: oṁ indrāya hrīḥ | yamāya ṣṭrīḥ | varuṇāya viḥ | kuberāya kṛ | īśvanāya taḥ | agnaye ā | nairṛtyāya na | vāyave na | candrāya hūṁ | arkāya hūṁ | brahmaṇe phaṭ | vasudhārāyai phaṭ | vemacitriṇe svā | sarva­bhūtebhyo hā | ha ha hi hi hūṁ hūṁ pheṁ pheṁ svāhā | “Once the triangular maṇḍala is made, Using a mixture of urine, feces, and water, The yogin should satisfy the deities, And should call to mind the syllables hā hā.

source: དཀྱིལ་འཁོར་རིམ་གསུམ་བྱ་བ་ནི། །བརྒྱད་དང་བཅུ་གཉིས་བཅུ་དྲུག་པའི། །དཀྱིལ་འཁོར་མཁས་པས་བྲིས་པ་ལ། །སྔགས་ནི་ཀུན་ཏུ་དགོད་པར་བྱ། །
en: “The adept should draw Three concentric circles, With eight, twelve, and sixteen cells And place the mantra syllables throughout.

source: བརྟུལ་ཞུགས་ཅན་གྱིས་བཅུ་གཉིས་པར། །གྲུབ་པའི་སྔགས་རྣམས་དགོད་པར་བྱ། །རྒྱུ་དང་མི་རྒྱུའི་འཇིག་རྟེན་གསུམ། །མ་ལུས་ལུས་པ་མེད་པར་འགྲུབ། །ཡ་མ་རཱ་ཛཱ་ས་དོ་མེ་ཡ། ཡ་མེ་དོ་རུ། ཎ་ཡོད་ཡ། ཡ་ད་ཡོ་ནི། ར་ཡ་ཀྵེ་ཡ། ཡ་ཀྵེ་ཡཙྪ།
en: “The vow-holder should place The perfected syllables in the twelve cells The vow-holder will be victorious in every way Over the three worlds, the animate and inanimate.

source: ནི་རཱ་མ་ཡ། དཀྱིལ་དུ་ཡ་བྱས་ཤར་དུ་ཀྵེ། །ལྷོ་རུ་འཇམ་པའི་རྡོ་རྗེ་སྟེ། །ཡི་གེ་མེ་ནི་ནུབ་དུ་བྲི། །བྱང་དུ་ད་སྟེ་ད་མ་ནཱ། །
en: ya ma rā jā sa do me ya ya me do ru ṇa yo da ya | ya da yo ni ra ya kṣe ya ya kṣe ya ccha ni rā ma ya “Ya is to be placed in the center, kṣe to the east, In the south, Mañjuvajra, The syllable me is drawn in the west, And in the north, dantadhāvanam.

source: བསྒྲུབ་བྱའི་མིང་ནི་སྦྱིན་བྱ་བ། །མཚམས་ཀྱི་སྟོད་པ་དག་ཏུའོ། །
en: “The target’s name should be added In the empty intermediate directions.

source: ཧཱུྃ་གཉིས་ཀྱིས་ནི་བརྟེན་བྱས་པས། །དགོས་པ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད། །
en: By framing it with two hūṁs, All ritual actions will be successful.

source: ཡཙྪ་ནི་རཱ་ཛཱ་ས་དོ་རུ། །ཎ་ཡོ་ནི་རལ་སོགས་པ། །ཕྱི་རོལ་རིམ་པར་གཡོན་བརྩམས་བྲི། །
en: “The syllables ya, ccha, ni, rā, jā, Sa, do, ru, ṇa, yo, ni, ra, and the rest, Should be drawn outside, from the left.

source: དོན་ཀུན་རབ་ཏུ་བསྒྲུབ་པའི་ཕྱིར། །
en: This will fulfill all aims.

source: རིམ་པ་གསུམ་པ་དེ་ལ་ནི། །ཀུན་དུ་ཆ་རེ་བོར་བ་ལ། །ཤར་ནས་བརྩམས་ནས་བྲི་བར་བྱ། །ཨོཾ་ཧྲཱིཿཥྚྲཱིཿལ་སོགས་པའི་སྔགས། །
en: “In the third ring, from the east, One should draw the syllables Of the mantra beginning oṁ hrīḥ ṣṭrīḥ In every other cell.

source: དེ་ཡི་བར་དག་ཐམས་ཅད་ཀྱི། །ཆ་བརྒྱད་པོར་བ་དག་ལ་བྲི། །ཨ་མུ་ཀཾ་ཀུ་རུ། ཨུཙྪ་ཊ་ཡ། ཝ་ཤཾ་ཀུ་རུ། བི་དྭ་ཥ་ཡ། ཤནྟིཾ་ཀུ་རུ།
en: “In each of the eight intermediate cells, One should write, from the left Mūkaṃ kuru,uccāṭaya,vaśīkuru, vidveṣaya, śāntiṃ kuru, or puṣṭiṃ kuru, Depending on the specific rite.

source: པུཥྚིཾ་ཀུ་རུ། འདི་ལྟར་གཡོན་ནས་བརྩམས་ནས་ནི། །ལས་དང་རྗེས་སུ་མཐུན་པར་ནི། །མིང་དང་ན་མཿཐ་མའི་བར། །ཐ་མ་རུ་བཽ་ཥ་ཊ་དང་། །
en: “Oṁ is at the beginning and then namaḥ after that, And then, after that, vauṣaṭ.

source: ཧཱུྃ་ཕཊ་དང་ལྡན་ས་བོན་གྱིས། །ཞི་དང་རྒྱས་དང་མཐར་དབང་བྱེད། །
en: Furnishing these seeds with hūṃ and phaṭ Effects the pacifying, enriching, and enthralling rites.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་འཁོར་ལོ་རྣམ་པར་བྲི་བ་ཞེས་བྱ་བ་སྟེ་རིམ་པར་ཕྱེ་བ་དྲུག་པའོ།། །།
en: This was the sixth chapter, “Drawing the Circle,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: ཁྲག་དགུག་པ་ཡི་སྦྱོར་བ་ནི། །
en: Chapter 7: The Procedures for Extraction and So Forth “For the procedure to extract blood The adept should meditate on Carcikā.

source: ཞལ་གསུམ་ཕྱག་དྲུག་སྐེམ་པ་ཡི། །ཕྱག་ན་འཁོར་ལོ་ཟླ་འོད་འདྲའི། །
en: She has three faces, six arms, is emaciated, Holds a wheel in her hand, and shines like the light of the moon.

source: མཁས་པས་ཙརྩི་ཀཱ་བསྒོམ་བྱ། །ཆང་དག་དགུག་པའི་སྦྱོར་བ་ནི། །
en: “For the procedure to extract alcohol The adept should meditate on Vārāhī.

source: ཞལ་གསུམ་ཕྱག་དྲུག་ཕག་གདོང་མ། །རབ་སྔོ་ཕྱག་ན་རྡོ་རྗེ་བསྣམས། །
en: She has three faces, six arms, the face of a sow, Is dark blue, and holds a vajra in her hand.

source: མཁས་པས་ཕག་མོ་བསྒོམ་པར་བྱ། །ཤེས་རབ་བསྐྱེད་པར་བྱ་བའི་ཕྱིར། །
en: “To increase knowledge The vow-holder should meditate on Sarasvatī.

source: ཞལ་གསུམ་ཕྱག་དྲུག་དམར་བ་ལ། །ཞི་བ་ཕྱག་ན་པདྨ་བསྣམས། །
en: She has three faces, six arms, is red, Peaceful, and holds a lotus in her hand.

source: དབྱངས་ཅན་བརྟུལ་ཞུགས་ཅན་གྱིས་བསྒོམ། །ཁུ་བ་དགུག་པའི་སྦྱོར་བ་ནི། །
en: “For the procedure to draw semen The adept should meditate on Gaurī.

source: ཞལ་གསུམ་ཕྱག་དྲུག་རལ་གྲི་བསྣམས། །ནོར་བུ་མརྒད་འདྲ་བ་ནི། །
en: She has three faces, six arms, wields a sword, And appears like an emerald.”

source: གཽ་རཱི་མཁས་པས་བསྒོམ་པར་བྱ། །དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་གཤེན་རྗེའི་གཤེད་པོ་གསད་པ་དང་དགུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་རྡོ་རྗེ་ཙརྩི་ཀཱའི་སྔགས་འདི་གསུངས་སོ། །ཨོཾ་ཙརྩི་ཀཱ་སིདྡྷེ་ན་དྲ་ནཱི་ལ་ཧཱ་རི་ཎི་རཏྣ་ཏྲ་ཡ་ཨ་པ་ཀཱ་རི་ཎོ་རུ་དི་ར་ཨཱ་ཀརྵ་ཡ་ཛཿ། སྔགས་འདི་དག་ནི་དྲན་བྱས་ན། །ཁ་གདངས་པ་དག་བྱས་པ་ཡིན། །
en: Then, the blessed Vajra Yama’s Destroyer entered the meditative absorption called killing and extracting and spoke the mantra of Carcikā: oṁ carcike siddhendranī­lahāriṇi ratna­trayāpakāriṇo rudiram ākarṣaya jaḥ | “One should open their mouth And then call this mantra to mind.

source: འཇིག་རྟེན་གསུམ་གྱི་ཁྲག་ཆེན་པོ། །འགུགས་པ་འདི་ལ་ཐེ་ཚོམ་མེད། །
en: The great blood from the three worlds Will be extracted, there is no doubt.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་གཤིན་རྗེའི་གཤེད་ཆེན་པོ་ཆང་འགུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ། རྡོ་རྗེ་ཕག་མོའི་ཆང་འགུགས་པའི་སྔགས་གསུངས་པ། ཨོཾ་བཛྲ་གྷོ་ཎེ་སུགྷོ་ཎེ་བཛྲ་མཱ་མ་ཀཱི་བྷ་ར་བྷ་ར། སམྦྷ་ར་སམྦྷ་ར། ཏྲཻ་དྷཱ་ཏུ་ཀཱརྱཾ། ཨཱ་ཀརྵ་ཡ་ཛཿ། རྫ་མཁན་ལག་པ་ཕྱིས་པའི་སས། །བུམ་པ་ཁ་མཛེས་ཉེར་བྱས་ལ། །རྐུན་མའི་སྐྲ་ནི་རྟེན་བཞག་སྟེ། །
en: Then, the blessed great Vajra Yamāri entered the meditative absorption called extracting alcohol and spoke Vajravārāhī’s mantra for extracting alcohol: oṁ vajra­ghoṇe sughoṇe vajra­māmakī bhara bhara sambhara sambhara traidhātu­kāryam ākarṣaya jaḥ | “One should make a pot with a beautiful mouth Using clay from a potter’s hand, Place it on a base of thief’s hair, And call the mantra to mind.

source: སྔགས་ནི་རྗེས་སུ་དྲན་པར་བྱ། །སྔགས་འདི་ཆེ་བའི་བདག་ཉིད་འདི། །བ་ཏ་མཆོད་རྟེན་དག་ཏུ་བསྟན། །
en: “The great quality of this mantra Was demonstrated at Caityapattana.

source: དལ་གྱིས་དམིགས་ནས་འབད་པར་བྱ། །ཆང་ནི་འགུགས་པར་རབ་ཏུ་གྲགས། །
en: One should exert effort with gentle persistence And the alcohol extraction will be successful.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དམ་ཚིག་ཆེན་པོའི་གཤིན་རྗེའི་གཤེད་རྡོ་རྗེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་རྡོ་རྗེ་དབྱངས་ཅན་མའི་སྔགས་གསུངས་པ། ཨོཾ་པི་ཙུ་པི་ཙུ་པྲཛྙཱ་བརྡྷ་ནི་ཛྭཱ་ལ་ཛྭཱ་ལ་མེ་དྷཱ་བརྡྷ་ནི། དྷི་ནི་དྷི་ནི། བུདྡྷི་བརྡྷ་ནི་སྭཱ་ཧཱ། ཚེས་ཀྱི་དང་པོ་ནས་བཟུང་སྟེ། །ཀུན་ཏུ་ཟླ་བ་ཉ་ཡི་བར། །
en: Then the blessed Vajra Yama’s Slayer, the great samaya, entered the meditative absorption called the vajra perfection of wisdom and spoke the mantra of Sarasvatī: oṁ picu picu prajñāvardhani jvala jvala medhā­vardhani dhiri dhiri buddhi­vardhani svāhā | “Beginning on the first day And every day until the full moon, One should speak Sanskrit, And continue, following the phases of the moon.

source: སྦྱར་བའི་སྐད་ནི་སྨྲ་བར་བྱ། །ཇི་སྲིད་ཟླ་བའི་རྗེས་འཇུག་པས། །རྟག་ཏུ་ཚིགས་བཅད་བརྒྱ་ཟིན་འདི། །ངག་གི་དབང་ཕྱུག་འགྲུབ་པར་འགྱུར། །
en: “With the regular completion of one hundred ślokas One will succeed in becoming a lord of speech.

source: ཁམས་གསུམ་མ་ལུས་པ་དག་ནི། །མ་ལུས་ལུས་པ་མེད་པར་འགྲུབ། །
en: One will find success throughout the three worlds, Entirely and in every way.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་གཤིན་རྗེའི་གཤེད་རྡོ་རྗེས་ཁུ་བ་འགུགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས། ཁུ་བ་འགུགས་པར་བྱེད་པའི་གཽ་རཱིའི་སྔགས་འདི་གསུངས་སོ། །ཨོཾ་ཨཱཾ་ཀརྵ་ཎི་ཨཱ་ཀརྵ་ཎི་གོ་རཱི་ཧྲཱིཿདུཥྚཱ་ཡ། དུཥྚཱ་ཡ། ཤུ་ཀྲ་མ། ཨཱ་ཀརྵ་ཡ་ཛཿཛཿཛཿཧཱུཾ་ཧཱུཾ་ཧཱུཾ་སྭཱ་ཧཱ། པདྨ་ཁ་དང་རྡོ་རྗེ་དང་། །དྲིལ་བུ་ལྕགས་ཀྱུའི་རླུང་སྦྱོར་གྱིས། །བཟླས་དང་བསྒོམ་པའི་སྦྱོར་བ་ནི། །
en: Then, the blessed Vajra Yama’s Destroyer entered the meditative absorption called the extraction of semen and spoke Gaurī’s mantra for the extraction of semen: oṁ ākarṣaṇi ākarṣaṇi gaurī hrīḥ duṣṭāya duṣṭāya śukram ākarṣaya jaḥ jaḥ jaḥ hūṁ hūṁ hūṁ svāhā | “From the mouth of the lotus and from the vajra, Through the application of the bell, hook, and wind, An abundance of semen is extracted By employing mantra and meditation.

source: ཁུ་བའི་ཚོགས་ནི་འགུགས་པར་བྱེད། །ནགས་ཀྱི་ནང་ངམ་དབེན་པ་རུ། །ལས་འདི་དག་ནི་བསྐུལ་བྱས་ནས། །ནུབ་བདུན་ཙམ་དུ་སྦྱོར་བ་ཡིས། །འགྲུབ་འགྱུར་འདི་ལ་ཐེ་ཚོམ་མེད། །
en: “These rites, eagerly employed Over the course of seven nights In a forest or isolated place, Bring success, of this there is no doubt.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་གཤིན་རྗེའི་གཤེད་ཆེན་པོ། རྡོ་རྗེ་ནག་པོ་འཇིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་དབང་བསྐུར་བ་མཆོག་གི་དམ་ཚིག་འདི་ཉིད་ཀྱི་སྐུ་གསུང་ཐུགས་རྡོ་རྗེ་རྣམས་ལས་ཕྱུང་བར་མཛད་དོ། །ཨུ་དུམ་བཱ་ར་མ་ན་དཱ་ར། །པ་རི་ཛ་ཏ་ཀ་ཕྲེང་དང་། །
en: Then the blessed great Vajra Yamāri entered the meditative absorption called the vajra that terrifies death and set forth the samaya of the supreme initiation from his vajra body, speech, and mind.

source: ཀར་ཎི་ཀ་ཡི་ཕྲེང་བ་ནི། །བུ་ཁྱོད་ཟུང་ལ་བྱིན་གྱིས་རློབ། །
en: “Dear child, take garlands Of udumbara, mandāra, pārijāta, And karṇīkāra flowers, And be consecrated.

source: རལ་གྲི་ཆེན་པོ་ཁམས་གསུམ་པའི། །སངས་རྒྱས་ཀུན་གྱིས་ཕྱག་བྱས་པ། །
en: “Take the great sword of the triple world That is venerated by all buddhas And summons all spirits.

source: འབྱུང་པོ་ཐམས་ཅད་འགུགས་པར་བྱེད། །ལས་ཀྱི་རལ་གྲི་དམ་པ་འདི། །བཟུང་ན་བདུད་ལས་རྒྱལ་བར་འགྱུར། །
en: This sublime sword of activity Is victorious over all māras.

source: ཤེས་རབ་ཐབས་ཀྱི་ངོ་བོ་ཉིད། །རྡོ་རྗེ་དྲིལ་བུ་བསྒྲུབས་པ་འདི། །ལོང་ལ་སློབ་མ་ཡང་དག་ཟུང་། །
en: “Take the perfected vajra and bell, The nature of insight and method, And accept the disciple.

source: བཏུང་བ་རིན་པོ་ཆེ་འདིས་ནི། །རྡོ་རྗེ་ལུས་ནི་རབ་ཏུ་སྒྲུབ། །
en: “This most precious of drinks Perfects the vajra body.

source: ཀུན་ཏུ་ཡེ་ཤེས་བུ་ཁྱོད་ཀྱིས། །འཐུང་ཤིག་ཡེ་ཤེས་ལས་བྱུང་བ། །
en: Dear child of omniscient wisdom, Drink it so wisdom may arise.’

source: སློབ་མའི་ཁར་ཡང་བླུག་བྱ་བ། །གཤིན་རྗེའི་གཤེད་ཀྱིས་བསྒྲགས་པ་ཡིན། །
en: “It should then be poured into the disciple’s mouth, In order to accomplish Yamāri.

source: རྡོ་རྗེ་སློབ་མ་བདག་ཉིད་ཆེས། །ཤིན་ཏུ་དགའ་བའི་སེམས་སུ་བྱ། །
en: The eminent vajra disciple Should cultivate feeling of great joy.”

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་དགུག་པ་ལ་སོགས་པའི་སྦྱོར་བའི་རིམ་པར་ཕྱེ་བ་སྟེ་བདུན་པའོ།། །།
en: This was the seventh chapter, “The Procedures for Extraction and So Forth,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: དེ་ནས་རྡོ་རྗེ་འཛིན་རྒྱལ་པོ། །སྲུང་བའི་འཁོར་ལོ་སྦྱོར་བར་བྱེད། །བགེགས་དང་ལོག་པར་འདྲེན་པ་དང་། །གདུག་པ་ཅན་དག་བསལ་ཕྱིར་གསུངས། །
en: Chapter 8: The Fire Offering Rite Then, the vajra-bearing king Employed the protection circle procedure And spoke in order to expel Vighnas, vināyakas, and wicked beings.

source: དཔལ་ལྡན་རལ་གྲི་འཆང་བའི་བདག །སྲུང་བའི་འཁོར་ལོ་སྦྱོར་བར་བྱེད། །རལ་གྲི་འབར་བའི་བདག་ཉིད་ཀྱིས། །
en: “I, the glorious sword bearer, Employ the protection circle procedure Using the naturally blazing sword.

source: རིག་པ་གསུམ་ལས་མཆོད་པར་བྱེད། །
en: I offer worship through the three knowledges.

source: སེམས་ཅན་ཐམས་ཅད་སྐྱོབ་པ་ཡི། །སྤྱོད་པའི་ཚུལ་དང་ཁྱད་པར་གྱིས། །ས་དང་ཕ་རོལ་ཕྱིན་པ་ལ། །ལྷ་མོ་ཁྱོད་ནི་དཔང་དུ་གྱུར། །
en: “Devī, you serve as witness To the mode of conduct That protects all beings, Especially to the bhūmis and perfections.

source: གཤིན་རྗེའི་གཤེད་ཀྱི་དཀྱིལ་འཁོར་ནི། །སློབ་དཔོན་བདག་གིས་དཀྱིལ་འཁོར་བྲི། །
en: “I, the master, will draw The maṇḍala of Yamāri.

source: གོས་ཀྱིས་གདོང་ནི་བཅིངས་བྱས་ལ། །དཀྱིལ་འཁོར་གྱི་ནི་མདུན་སྐོར་བཞག །
en: “After covering the disciple’s face with cloth, They should enter the door of the maṇḍala.

source: ཁྱོད་སུ་ཞེས་ཀྱང་འདི་སྐད་དྲི། །
en: They should be asked, ‘Who are you?’

source: སྐལ་བཟང་བདག་ཅེས་ཚིག་ཏུ་བརྗོད། །
en: To which they reply, ‘I am a fortunate one.’

source: གསོལ་བཏབ་པ་ཡི་བློ་བཟང་ལ། །ཡོལ་བའི་ནང་དུ་སྦྱིན་པར་བྱ། །
en: “The keen disciple who makes the request Should be given access behind the curtain.

source: དབང་བསྐུར་དོན་དུ་གུས་ཆེན་པོས། །དེ་ནས་ལན་གསུམ་ཆེད་དུ་བརྗོད། །ཇི་ལྟར་སངས་རྒྱས་ཆོས་ཆེན་པོས། །རྡོ་རྗེ་སེམས་དཔའ་དབང་བསྐུར་ལྟར། །བདག་ཀྱང་མགོན་པོས་དབང་བསྐུར་ཞིང་། །
en: In order to receive initiation they should Make this request devotedly three times: “ ‘Just as the Buddha initiated the vajra-being By means of the great Dharma, I ask the protector to also initiate me, And grant me a boon.’

source: མཆོག་ཀྱང་བདག་ལ་སྩལ་དུ་གསོལ། །དེ་བཞིན་གླུ་དང་རོལ་མོས་མཆོད། །དེ་བཞིན་ཁྲུས་དང་བྱུག་པས་ཀྱང་། །སློབ་མ་དང་བས་བླུག་པར་བྱ། །དེ་ལ་བསྟོད་པ་ཀུན་ཀྱང་བྱ། །
en: “The disciple should offer song and music, As well as respectfully anoint With bathing water and unguents, And sing praises at that time.”

source: དེ་ནས་རྡོ་རྗེ་འཆང་གི་རྒྱལ་པོས་སྟོང་པའི་སྔགས་གསུངས་པ། །ཨོྃ་ཤཱུ་ནྱཏཱ་ཛྙཱ་ན་བཛྲ་སྭ་བྷཱ་ཝ་ཨཱཏྨ་ཀོ྅ཧྃ། ཨོྃ་པཱུ་ཛ་བཛྲ་སྭབྷཱ་བ་ཨཱཏྨ་ཀོ྅ཧཾ། ཨོྃ་དྷརྨ་དྷཱ་ཏུ་བཛྲ་སྭབྷཱ་བ་ཨཱཏྨ་ཀོ྅ཧཾ། ཞི་བ་ལ་སོགས་དབྱེ་བ་ཡི། །སྦྱིན་སྲེག་དེ་ནས་བཤད་པར་བྱ། །
en: Then, the vajra-bearing king spoke the mantra of emptiness: oṁ śūnyatājñāna­vajra­svabhāvātmako ’ham | oṁ pūja­vajra­svabhāvātmako ’ham | oṁ dharma­dhātu­vajra­svabhāvātmako ’ham | “Next, I will explain the fire offering, Based on its use in pacifying and other rites.

source: སྦྱིན་སྲེག་གང་གིས་གྲུབ་པ་ཡི། །ལས་རྣམས་ཐམས་ཅད་རབ་སྒྲུབ་པ། །
en: It is through fire offering that one gains the siddhi That accomplishes all rites.

source: ཞི་བ་ཞི་བའི་སེམས་ཀྱིས་ཏེ། །རྒྱས་པ་རྒྱས་པའི་སེམས་ཀྱིས་སོ། །དབང་ཡང་དེར་གཏང་སེམས་ཀྱིས་ཏེ། །བསད་དང་བསྐྲད་པ་ལ་ཡང་ངོ་། །
en: “Pacifying rites require a peaceful mind, Enriching rites, an expansive mind, Enthralling rites, a mind that has let go, And this too for killing and expelling.

source: ཞི་བའི་དཀྱིལ་འཁོར་ཟླུམ་པོ་སྟེ། །རྒྱས་པ་ཡི་ནི་རྫིང་བུ་འདྲ། །དབང་དུ་བྱ་བ་ཟླ་གམ་ལྟར། །ནམ་མཁའི་ཁམས་འདྲ་བས་ནི་བསད། །
en: “For the pacifying, the fire pit is circular, For enriching, like a water tank, For enthralling, crescent-shaped, And like the space element for killing.

source: ཞི་བ་ཁྲུ་གང་ཚད་དུ་སྟེ། །དེ་བཞིན་རྒྱས་པའི་ཁྲུ་དོ་པ། །ཇི་ལྟར་རྒྱས་པ་དེ་ལྟར་དབང་། །བསད་པ་ལ་ནི་སོར་ཉི་ཤུ། །
en: “For pacifying, it should measure one cubit, For enriching, two cubits, As for enriching, so for enthralling, And for killing, twenty finger-widths.

source: ཞི་བ་སྟེང་དུ་ཁྲུ་ཕྱེད་ཚད། །རྒྱུས་པ་ལ་ནི་ཁྲུ་ཙམ་སྟེ། །སོར་ལྔ་གཉིས་ནི་བསད་པ་ལ། །དབང་ལ་ཇི་ལྟར་དེ་བཞིན་དགུག །
en: “For pacifying, half a cubit up, For enriching, one cubit, Ten finger-widths for killing, And for enthralling, the same as summoning.

source: ཚེས་གཅིག་ལ་ནི་ཞི་བ་བྱ། །ཟླ་བ་ཉ་ལ་རྒྱས་པ་སྟེ། །བཅུ་བཞི་ལ་ནི་མངོན་སྤྱོད་དོ། །དབང་གི་ལས་ནི་ཚེས་བརྒྱད་ལའོ། །
en: “Pacifying should be performed on the first day, Enriching on the full moon, The fourteenth day for hostile rites, And enthralling rites on the eighth day.”

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་སྦྱིན་སྲེག་གི་ཆོ་ག་རིམ་པར་ཕྱེ་བ་སྟེ་བརྒྱད་པའོ།། །།
en: This was the eighth chapter, “The Fire Offering Rite,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: རྒྱ་མཚོའི་ས་ནི་བླངས་བྱས་ལ། །ཀླུ་ཡི་གཟུགས་གཅིག་བརྩམས་བྱས་ཏེ། །ཡི་གེ་ཧཱུྃ་ཕུཿསྙིང་གར་ནི། །ཧྲཱིཿཥྚྲཱིཿལ་སོགས་བཟླས་པ་བྱ། །ཆར་ནི་མི་འབབ་དུས་དག་ཏུ། །བཟླས་པ་ཁྲི་བྱས་འབབ་པར་འགྱུར། །སྦྲུལ་ནག་པོ་ཡི་ཤ་དང་ནི། །
en: Chapter 9: Fearsome Yamāri “One should take soil from the ocean, Make an image of a single nāga, Place the syllables hūṁ puḥ at its heart, And recite the mantra that begins hrīḥ ṣṭrīḥ.

source: ནིམ་པའི་ལོ་མ་དང་བསྲེས་ལ། །དེ་ལ་རིལ་བུ་བྱས་ནས་ནི། །བརྟུལ་ཞུགས་ཅན་གྱིས་རྒྱ་མཚོར་གཞུག །སྔགས་ཀྱི་བཟླས་པ་ཁྲི་བྱས་ན། །
en: Rain will fall at times of drought By reciting the mantra ten thousand times, “The vow-holder should mix cobra meat With leaves of the neem tree, Roll the mixture into a pill, Throw it into the ocean, And recite the mantra ten thousand times.

source: མཚོ་རླབས་རེངས་བྱེད་མཆོག་ཡིན་ནོ། །
en: This is the supreme means for arresting waves.

source: ཙནྡན་འབྲས་བུ་བརྒྱ་བླངས་ལ། །འབྲས་དང་མར་ཤས་བསྲེས་བྱས་ཏེ། །འབུམ་ཕྲག་བརྒྱ་ནི་རབ་བཟླས་ལ། །
en: “One should take one hundred datura seeds, Mixed with beans and rice grains, And perform a fire offering with 800,000 recitations.

source: སྦྱིན་སྲེག་བྱས་ན་ལྷ་མཐོང་འགྱུར། །
en: One will then behold the deity.

source: དུར་ཁྲོད་རོ་བསྲེགས་ཡོག་པའི་ཤིང་། །བརྟུལ་ཞུགས་ཅན་གྱི་གཟུགས་སུ་བྲི། །སྨྱོན་པའི་ཁུ་བས་བསྐུ་བྱས་ལ། །
en: “The vow-holder should draw an effigy With charred stick from a cremation pyre And smear it with datura fluid.

source: སྔགས་ཁྲི་བཟླས་པས་མཛེས་ཐེབས་འགྱུར། །
en: After reciting the mantra 10,000 times the target will develop leprosy.

source: གྲུབ་པའི་ཡུངས་ཀར་བླངས་བྱས་ལ། །འབུམ་ཕྲག་བཞི་ནི་བཟླས་བྱས་ན། །སྦྲུལ་གྱིས་བཟུང་ནས་འགྱེལ་བ་ལ། །
en: “One should take white mustard seeds, Recite the mantra 400,000 times, And scatter them over a person collapsed from snake bite.

source: གཏོར་ན་འཚོ་བར་ཐེ་ཚོམ་མེད། །
en: That person will recover—there is no doubt.

source: རི་གཤོང་ཆུ་ཡི་ས་བླངས་ལ། །སྔགས་ཀྱི་བཟླས་པ་འབུམ་བྱས་ནས། །
en: “One should take clay from a gulch And recite the mantra 100,000 times.

source: མགོ་ལ་བསྐུས་པ་ཙམ་གྱིས་ནི། །མགོ་ཡི་ནད་ནི་ཉམས་པར་བྱེད། །
en: Any headache will be cured By smearing this on one’s head.

source: སྔགས་ནི་ལན་བདུན་མངོན་བཟླས་པའི། །ལག་པས་མགོ་བོ་མཉེས་ན་ནི། །མགོ་ནི་ཟུག་གཟེར་འབྱུང་མི་འགྱུར། །དེ་ནི་འདི་ལྟར་ཐེ་ཚོམ་མེད། །
en: “When one incants their hand seven times And uses it to rub their head, There will be no head pain— About this there is no doubt.

source: བྲམ་ཟེ་ཡི་ནི་ཤ་དག་ལ། །དུར་ཁྲོད་ས་དང་ཐལ་བ་ལས། །གཤིན་རྗེའི་གཤེད་ཀྱི་གཟུགས་བྱས་ཏེ། །
en: “One should make an effigy of Yamāri From the flesh of a brahmin And ash and soil from a charnel ground.

source: ཕྱག་གཉིས་ཞལ་ནི་གཅིག་པ་ལ། །རྡོ་རྗེ་ཆེན་པོ་གཡས་པ་ན། །དེ་བཞིན་མི་མགོ་གཡོན་པ་ནའོ། །
en: He should have two arms and one face, Hold a large vajra in his right hand, And a human head in his left.

source: མདོག་ནི་དཀར་པོ་ཆེར་འཇིགས་པ། །
en: He should be white and very frightening.

source: དེ་ཡིས་གདུག་པ་འཇོམས་པར་བྱེད། །
en: All wicked beings can be destroyed with this.

source: བདུད་རྩི་ལྔ་དང་ཤ་ལྔ་ཡིས། །ཉིན་རེ་བཞིན་དུ་གཏོར་མ་སྦྱིན། །བདག་གི་དགྲ་བོ་ཆོམས་ཤིག་ཅེས། །རྣལ་འབྱོར་པས་བདག་གསོལ་བ་གདབ། །
en: “The yogin should offer bali daily, Using the five meats and the five nectars, And the make the request, ‘Annihilate my enemies!’

source: ནུབ་མོ་དེ་སྐད་བརྗོད་པས་ཉལ། །དགྲ་ནི་ཐོ་རངས་འཆི་བར་འགྱུར། །
en: “When this is said at night, before sleep, The enemy will be dead at dawn.

source: ཆུ་འགགས་ལ་སོགས་པས་གཟིར་ཞིང་། །ཡང་ན་ནད་ཀྱིས་ཐེབས་པར་འགྱུར། །
en: Or they will suffer from urinary blockage Or fall sick with another illness.

source: དགྲ་ཡི་བཻ་རོ་ཙ་ན་བླང་། །མི་ཡི་རྐང་སྦུབས་ཡོངས་བཀང་སྟེ། །
en: “One should take the enemy’s vairocanā And fill a human bone with it.

source: རབ་ཏུ་བཀང་ནས་འབུམ་བཟླས་ན། །ཤིང་རྩེར་རྒྱུ་བའི་ཡི་དགས་མཚུངས། །
en: Once full, and once the mantra is recited 100,000 times, One will be like a preta moving through treetops.

source: ལྷ་རྫས་དངོས་གྲུབ་ཀུན་བྱེད་ཅིང་། །དགོས་པ་སྣ་ཚོགས་རབ་སྒྲུབ་བོ། །
en: One will attain every excellent siddhi And achieve the various goals.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གསུང་ཐུགས་གཤིན་རྗེའི་གཤེད་ནག་པོའི་རྒྱུད་ལས་འཇིགས་བྱེད་གཤིན་རྗེའི་གཤེད་ཅེས་བྱ་བའི་རིམ་པར་ཕྱེ་པ་སྟེ་དགུ་བའོ།། །།
en: This was the ninth chapter, “Fearsome Yamāri,” from The Tantra of Black Yamāri, the Body, Speech, and Mind of All Tathāgatas.

source: རོ་ལངས་ཆེན་པོའི་སྒྲུབ་ཐབས་ནི། །དེ་ནས་ཡང་དག་བཤད་པར་བྱ། །
en: Chapter 10: Cultivating the Recollection for Mastering Vetālas “Next, I will perfectly explain The sādhana of the great vetāla.

source: སྒྲུབ་པ་བཟང་པོ་ཀུན་བྱེད་ཅིང་། །དགོས་པ་སྣ་ཚོགས་རབ་སྒྲུབ་པའོ། །
en: It effects every excellent siddhi And leads to the achievement of the various goals.

source: བཟང་པོ་མ་གོད་རྨ་མེད་པ། །ཤིང་ལ་སྦྱངས་པས་བསྡུས་བྱས་ལ། །
en: “The vow-holder should find a corpse hanging from a tree— A corpse that is clean, unspoiled, and without wounds.

source: ཕབ་ལ་ལེགས་པར་བཀྲུ་བྱ་སྟེ། །དེར་འདུག་སྔགས་བཟླས་བརྟུལ་ཞུགས་ཅན། །
en: They should take it down, wash it well, And incant it with mantra where it lays.

source: ཨེ་མའོ་ངོ་མཚར་སྔགས་ཀྱི་མཐུ། །བསམ་པ་མེད་པའི་འོ་དོད་འབོད། །
en: “Amazing, the power of mantra Whereby the insensate cries out!

source: གཤིན་རྗེའི་རྣལ་འབྱོར་ལྡན་པ་ཡི། །ཡིད་ཀྱིས་ཅུང་ཟད་འཇིགས་མི་བྱ། །
en: The one who practices the yoga of Yamāri Should be entirely without fear.

source: རྣལ་འབྱོར་ལམ་ནི་གང་འདོར་པ། །དེ་ཀུན་ཐམས་ཅད་སྟེར་བར་བྱེད། །
en: Whatever it is the yogin seeks Will be bestowed in full.

source: སྟག་དང་དེ་ལས་གཞན་པ་དང་། །དོམ་དང་སྤྲེའུ་དག་ལ་ནི། །ཁྱི་དག་གི་ནི་ཁྱད་པར་དང་། །
en: “One should craft an effigy Of Yamāri’s terrifying form, From the flesh, of a buffalo and crocodile, As well as a tiger, A bear, a monkey, And specifically, a dog.

source: དུག་དག་སྐེ་ཚེ་ཚྭ་དང་ནི། །དེ་བཞིན་ཚྭ་གསུམ་སོ་པཉྫ། །འདི་དག་ལེགས་པར་སྦྱར་གཟུགས་བྱ། །གཤིན་རྗེའི་གཤེད་པོ་འཇིགས་པའི་གཟུགས། །
en: One should also use poison, black mustard seeds, salt, The three hot spices, and the moringa tree.

source: དེ་ལ་རྣལ་འབྱོར་པས་གསོལ་གདབ། །ཧྲཱིཿཥྚྲཱིཿལ་སོགས་སྔགས་ཀྱིས་ནི། །ཆེ་གེ་མོ་དེ་བདག་ལ་སྩོལ། །
en: “The yogi should make a request of this effigy Using the mantra beginning hrīḥ ṣṭrīḥ And saying, ‘I seek so-and-so.’

source: དེ་ཡི་ཕ་ཡིས་སྟེར་བར་བྱེད། །
en: Her father will then present her.

source: གལ་ཏེ་རྣལ་འབྱོར་པ་མ་ཕྱིན། །རྨི་ལམ་གཤིན་རྗེའི་གཤེད་བརྡེག་ཅིང་། །ལྷོ་ཡི་ཕྱོགས་སུ་ཁྱེར་མཐོང་ནས། །སད་ན་དེ་ཡི་ཕ་ཡིས་སྟེར། །
en: “If this does not come to pass, If the yogin sees Yamāri strike her in a dream, And carry her off to the south, Her father will present her when the yogin wakes.

source: ཞལ་གསུམ་ཕྱག་དྲུག་འཇིགས་པ་ལ། །ཨིནྡྲ་ནཱི་ལ་འདྲ་བའི་མདོག །ཐོ་བ་འཛིན་པའི་བརྟུལ་ཞུགས་ཅན། །
en: “The vow-holder should visualize Mudgara Yamāri As fearsome, with three faces and six arms.

source: ཕྱག་ཏུ་ཐོ་བ་དགོད་པར་བྱ། །
en: He has the appearance of a sapphire And has a hammer in his hand.

source: ཞལ་གསུམ་ཕྱག་དྲུག་ཁྲོས་པ་ལ། །མདོག་དམར་པོ་སྟེ་ཁྲོས་པར་འཇིགས། །
en: “Daṇḍa Yamāri has three faces and six arms, And is red, wrathful, and terrifying.

source: འཇིགས་པ་ཡང་ནི་འཇིགས་པར་མཛད། །
en: Terrifying even to the terrifying.

source: མཁས་པས་ཕྱག་ཏུ་དབྱིག་པ་དགོད། །
en: The adept should place a cudgel in his hand.

source: ཞལ་གསུམ་ཕྱག་དྲུག་དམར་བ་ལ། །འཇིགས་པ་ཆེན་པོ་བསྡིགས་པ་ཡི། །ཕྱག་ན་པདྨ་དམར་པོ་བསྣམས། །
en: “The adept should visualize the one called Padma Yamāri. He has three faces, six arms, and is red in color; He is extremely frightening, terrifying, And holds a red lotus in his hand.

source: པདྨ་ཞེས་བྱ་མཁས་པས་བསྒོམ། །ཞལ་གསུམ་ཕྱག་དྲུག་ལྗང་གུ་སྟེ། །
en: “One should visualize the one called Khaḍga Yamāri, Who has three faces, six arms, and is green.

source: ཕྱག་ན་རལ་གྲི་བསྣམས་པ་ཡི། །ལས་ཀུན་བྱེད་པར་གྱུར་པའོ། །རལ་གྲི་ཞེས་བྱ་རྣམ་བསྒོམ་བྱ། །
en: He accomplishes all activities And holds a sword in his hand.

source: བྷ་གར་ལིང་ག་རྣམ་བསྒོམ་ཉིད། །དཀྱིལ་འཁོར་བདག་པོ་རྣམ་པར་བསྒོམ། །
en: “With one’s liṅga in the bhaga, One should visualize the lord of the maṇḍala.

source: ཞེ་སྡང་རྗེས་དྲན་རྣལ་འབྱོར་གྱིས། །གཏི་མུག་རྗེས་དྲན་རྣམ་བསྒོམ་བྱ། །
en: The yogin who has brought anger to mind Should cultivate the recollection of ignorance.

source: གཏི་མུག་རྗེས་དྲན་ལ་དམིགས་ནས། །ཕྲ་མ་རྗེས་དྲན་བསྒོམ་པར་བྱ། །
en: “After making ignorance the object of recollection, One should cultivate the recollection of miserliness.

source: ཕྲ་མ་རྗེས་དྲན་རྣལ་འབྱོར་གྱིས། །འདོད་ཆགས་རྗེས་དྲན་བསྒོམ་པར་བྱ། །
en: The one absorbed in recollecting miserliness Should next cultivate the recollection of desire.

source: འདོད་ཆགས་རྗེས་དྲན་རྣལ་འབྱོར་གྱིས། །ཕྲག་དོག་དྲན་བྱ་བརྟུལ་ཞུགས་ཅན། །
en: “The vow-holder immersed in recollecting desire Should recollect the one called jealousy.

source: སོ་སོའི་རིགས་ཀྱི་སྤྲིན་རྣམས་ནི། །བ་སྤུའི་ཁུང་ནས་སྤྲོ་བར་བྱ། །
en: Clouds of deities from each of their families Emanate from their pores.

source: ཉི་མའི་དཀྱིལ་འཁོར་དབུས་སུ་ནི། །གཏུམ་པོའི་ཁྲོ་བོ་བསྒོམ་པར་བྱ། །
en: “The four wrathful ones should be visualized Standing in the center of sun disks.
